susanw1/zscript/receivers/native/arm/implementations/no-os-stm32/src/main/c++/stm32/AlternateFunction/STM32F76x.h
/*
 * This file is automatically generated by afTable.py from the xml descriptions provided as part of the STM32Cube IDE
 * Timestamp: 2022-12-19T23:52:17.088557
 */

#ifndef LOWLEVEL_INCLUDE_DEVICE_ALTERNATE_FUNCTION
#define LOWLEVEL_INCLUDE_DEVICE_ALTERNATE_FUNCTION

#define CAN1_RX_PA11_ PA11,GPIO_AF9
#define CAN1_RX_PB8_ PB8,GPIO_AF9
#define CAN1_RX_PD0_ PD0,GPIO_AF9
#define CAN1_RX_PH14_ PH14,GPIO_AF9
#define CAN1_RX_PI9_ PI9,GPIO_AF9
#define _CAN1_RX_PA11_ 1
#define _CAN1_RX_PB8_ 1
#define _CAN1_RX_PD0_ 1
#define _CAN1_RX_PH14_ 1
#define _CAN1_RX_PI9_ 1

#define CAN1_TX_PA12_ PA12,GPIO_AF9
#define CAN1_TX_PB9_ PB9,GPIO_AF9
#define CAN1_TX_PD1_ PD1,GPIO_AF9
#define CAN1_TX_PH13_ PH13,GPIO_AF9
#define _CAN1_TX_PA12_ 1
#define _CAN1_TX_PB9_ 1
#define _CAN1_TX_PD1_ 1
#define _CAN1_TX_PH13_ 1

#define CAN2_RX_PB12_ PB12,GPIO_AF9
#define CAN2_RX_PB5_ PB5,GPIO_AF9
#define _CAN2_RX_PB12_ 1
#define _CAN2_RX_PB5_ 1

#define CAN2_TX_PB13_ PB13,GPIO_AF9
#define CAN2_TX_PB6_ PB6,GPIO_AF9
#define _CAN2_TX_PB13_ 1
#define _CAN2_TX_PB6_ 1

#define CAN3_RX_PA8_ PA8,GPIO_AF11
#define CAN3_RX_PB3_ PB3,GPIO_AF11
#define _CAN3_RX_PA8_ 1
#define _CAN3_RX_PB3_ 1

#define CAN3_TX_PA15_ PA15,GPIO_AF11
#define CAN3_TX_PB4_ PB4,GPIO_AF11
#define _CAN3_TX_PA15_ 1
#define _CAN3_TX_PB4_ 1

#define CEC_PA15_ PA15,GPIO_AF4
#define CEC_PB6_ PB6,GPIO_AF3
#define _CEC_PA15_ 1
#define _CEC_PB6_ 1

#define DCMI_D0_PA9_ PA9,GPIO_AF13
#define DCMI_D0_PC6_ PC6,GPIO_AF13
#define DCMI_D0_PH9_ PH9,GPIO_AF13
#define _DCMI_D0_PA9_ 1
#define _DCMI_D0_PC6_ 1
#define _DCMI_D0_PH9_ 1

#define DCMI_D1_PA10_ PA10,GPIO_AF13
#define DCMI_D1_PC7_ PC7,GPIO_AF13
#define DCMI_D1_PH10_ PH10,GPIO_AF13
#define _DCMI_D1_PA10_ 1
#define _DCMI_D1_PC7_ 1
#define _DCMI_D1_PH10_ 1

#define DCMI_D10_PB5_ PB5,GPIO_AF13
#define DCMI_D10_PD6_ PD6,GPIO_AF13
#define DCMI_D10_PI3_ PI3,GPIO_AF13
#define _DCMI_D10_PB5_ 1
#define _DCMI_D10_PD6_ 1
#define _DCMI_D10_PI3_ 1

#define DCMI_D11_PD2_ PD2,GPIO_AF13
#define DCMI_D11_PF10_ PF10,GPIO_AF13
#define DCMI_D11_PH15_ PH15,GPIO_AF13
#define _DCMI_D11_PD2_ 1
#define _DCMI_D11_PF10_ 1
#define _DCMI_D11_PH15_ 1

#define DCMI_D12_PF11_ PF11,GPIO_AF13
#define DCMI_D12_PG6_ PG6,GPIO_AF13
#define _DCMI_D12_PF11_ 1
#define _DCMI_D12_PG6_ 1

#define DCMI_D13_PG15_ PG15,GPIO_AF13
#define DCMI_D13_PG7_ PG7,GPIO_AF13
#define DCMI_D13_PI0_ PI0,GPIO_AF13
#define _DCMI_D13_PG15_ 1
#define _DCMI_D13_PG7_ 1
#define _DCMI_D13_PI0_ 1

#define DCMI_D2_PC8_ PC8,GPIO_AF13
#define DCMI_D2_PE0_ PE0,GPIO_AF13
#define DCMI_D2_PG10_ PG10,GPIO_AF13
#define DCMI_D2_PH11_ PH11,GPIO_AF13
#define _DCMI_D2_PC8_ 1
#define _DCMI_D2_PE0_ 1
#define _DCMI_D2_PG10_ 1
#define _DCMI_D2_PH11_ 1

#define DCMI_D3_PC9_ PC9,GPIO_AF13
#define DCMI_D3_PE1_ PE1,GPIO_AF13
#define DCMI_D3_PG11_ PG11,GPIO_AF13
#define DCMI_D3_PH12_ PH12,GPIO_AF13
#define _DCMI_D3_PC9_ 1
#define _DCMI_D3_PE1_ 1
#define _DCMI_D3_PG11_ 1
#define _DCMI_D3_PH12_ 1

#define DCMI_D4_PC11_ PC11,GPIO_AF13
#define DCMI_D4_PE4_ PE4,GPIO_AF13
#define DCMI_D4_PH14_ PH14,GPIO_AF13
#define _DCMI_D4_PC11_ 1
#define _DCMI_D4_PE4_ 1
#define _DCMI_D4_PH14_ 1

#define DCMI_D5_PB6_ PB6,GPIO_AF13
#define DCMI_D5_PD3_ PD3,GPIO_AF13
#define DCMI_D5_PI4_ PI4,GPIO_AF13
#define _DCMI_D5_PB6_ 1
#define _DCMI_D5_PD3_ 1
#define _DCMI_D5_PI4_ 1

#define DCMI_D6_PB8_ PB8,GPIO_AF13
#define DCMI_D6_PE5_ PE5,GPIO_AF13
#define DCMI_D6_PI6_ PI6,GPIO_AF13
#define _DCMI_D6_PB8_ 1
#define _DCMI_D6_PE5_ 1
#define _DCMI_D6_PI6_ 1

#define DCMI_D7_PB9_ PB9,GPIO_AF13
#define DCMI_D7_PE6_ PE6,GPIO_AF13
#define DCMI_D7_PI7_ PI7,GPIO_AF13
#define _DCMI_D7_PB9_ 1
#define _DCMI_D7_PE6_ 1
#define _DCMI_D7_PI7_ 1

#define DCMI_D8_PC10_ PC10,GPIO_AF13
#define DCMI_D8_PH6_ PH6,GPIO_AF13
#define DCMI_D8_PI1_ PI1,GPIO_AF13
#define _DCMI_D8_PC10_ 1
#define _DCMI_D8_PH6_ 1
#define _DCMI_D8_PI1_ 1

#define DCMI_D9_PC12_ PC12,GPIO_AF13
#define DCMI_D9_PH7_ PH7,GPIO_AF13
#define DCMI_D9_PI2_ PI2,GPIO_AF13
#define _DCMI_D9_PC12_ 1
#define _DCMI_D9_PH7_ 1
#define _DCMI_D9_PI2_ 1

#define DCMI_HSYNC_PA4_ PA4,GPIO_AF13
#define DCMI_HSYNC_PH8_ PH8,GPIO_AF13
#define _DCMI_HSYNC_PA4_ 1
#define _DCMI_HSYNC_PH8_ 1

#define DCMI_PIXCLK_PA6_ PA6,GPIO_AF13
#define _DCMI_PIXCLK_PA6_ 1

#define DCMI_VSYNC_PB7_ PB7,GPIO_AF13
#define DCMI_VSYNC_PG9_ PG9,GPIO_AF13
#define DCMI_VSYNC_PI5_ PI5,GPIO_AF13
#define _DCMI_VSYNC_PB7_ 1
#define _DCMI_VSYNC_PG9_ 1
#define _DCMI_VSYNC_PI5_ 1

#define DFSDM1_CKIN0_PC0_ PC0,GPIO_AF3
#define DFSDM1_CKIN0_PD4_ PD4,GPIO_AF6
#define _DFSDM1_CKIN0_PC0_ 1
#define _DFSDM1_CKIN0_PD4_ 1

#define DFSDM1_CKIN1_PB13_ PB13,GPIO_AF6
#define DFSDM1_CKIN1_PB2_ PB2,GPIO_AF10
#define DFSDM1_CKIN1_PC2_ PC2,GPIO_AF3
#define DFSDM1_CKIN1_PD7_ PD7,GPIO_AF6
#define _DFSDM1_CKIN1_PB13_ 1
#define _DFSDM1_CKIN1_PB2_ 1
#define _DFSDM1_CKIN1_PC2_ 1
#define _DFSDM1_CKIN1_PD7_ 1

#define DFSDM1_CKIN2_PB15_ PB15,GPIO_AF6
#define DFSDM1_CKIN2_PC4_ PC4,GPIO_AF3
#define DFSDM1_CKIN2_PE8_ PE8,GPIO_AF6
#define _DFSDM1_CKIN2_PB15_ 1
#define _DFSDM1_CKIN2_PC4_ 1
#define _DFSDM1_CKIN2_PE8_ 1

#define DFSDM1_CKIN3_PC6_ PC6,GPIO_AF7
#define DFSDM1_CKIN3_PD8_ PD8,GPIO_AF3
#define DFSDM1_CKIN3_PE5_ PE5,GPIO_AF10
#define _DFSDM1_CKIN3_PC6_ 1
#define _DFSDM1_CKIN3_PD8_ 1
#define _DFSDM1_CKIN3_PE5_ 1

#define DFSDM1_CKIN4_PC1_ PC1,GPIO_AF10
#define DFSDM1_CKIN4_PD6_ PD6,GPIO_AF3
#define DFSDM1_CKIN4_PE11_ PE11,GPIO_AF6
#define _DFSDM1_CKIN4_PC1_ 1
#define _DFSDM1_CKIN4_PD6_ 1
#define _DFSDM1_CKIN4_PE11_ 1

#define DFSDM1_CKIN5_PB7_ PB7,GPIO_AF6
#define DFSDM1_CKIN5_PC10_ PC10,GPIO_AF3
#define DFSDM1_CKIN5_PE13_ PE13,GPIO_AF6
#define _DFSDM1_CKIN5_PB7_ 1
#define _DFSDM1_CKIN5_PC10_ 1
#define _DFSDM1_CKIN5_PE13_ 1

#define DFSDM1_CKIN6_PD0_ PD0,GPIO_AF3
#define DFSDM1_CKIN6_PF14_ PF14,GPIO_AF6
#define _DFSDM1_CKIN6_PD0_ 1
#define _DFSDM1_CKIN6_PF14_ 1

#define DFSDM1_CKIN7_PB11_ PB11,GPIO_AF6
#define DFSDM1_CKIN7_PB8_ PB8,GPIO_AF6
#define DFSDM1_CKIN7_PD1_ PD1,GPIO_AF6
#define _DFSDM1_CKIN7_PB11_ 1
#define _DFSDM1_CKIN7_PB8_ 1
#define _DFSDM1_CKIN7_PD1_ 1

#define DFSDM1_CKOUT_PB0_ PB0,GPIO_AF6
#define DFSDM1_CKOUT_PC2_ PC2,GPIO_AF6
#define DFSDM1_CKOUT_PD10_ PD10,GPIO_AF3
#define DFSDM1_CKOUT_PD3_ PD3,GPIO_AF3
#define DFSDM1_CKOUT_PE9_ PE9,GPIO_AF6
#define _DFSDM1_CKOUT_PB0_ 1
#define _DFSDM1_CKOUT_PC2_ 1
#define _DFSDM1_CKOUT_PD10_ 1
#define _DFSDM1_CKOUT_PD3_ 1
#define _DFSDM1_CKOUT_PE9_ 1

#define DFSDM1_DATIN0_PC1_ PC1,GPIO_AF3
#define DFSDM1_DATIN0_PD3_ PD3,GPIO_AF6
#define _DFSDM1_DATIN0_PC1_ 1
#define _DFSDM1_DATIN0_PD3_ 1

#define DFSDM1_DATIN1_PB1_ PB1,GPIO_AF6
#define DFSDM1_DATIN1_PB12_ PB12,GPIO_AF6
#define DFSDM1_DATIN1_PC3_ PC3,GPIO_AF3
#define DFSDM1_DATIN1_PD6_ PD6,GPIO_AF10
#define _DFSDM1_DATIN1_PB1_ 1
#define _DFSDM1_DATIN1_PB12_ 1
#define _DFSDM1_DATIN1_PC3_ 1
#define _DFSDM1_DATIN1_PD6_ 1

#define DFSDM1_DATIN2_PB14_ PB14,GPIO_AF6
#define DFSDM1_DATIN2_PC5_ PC5,GPIO_AF3
#define DFSDM1_DATIN2_PE7_ PE7,GPIO_AF6
#define _DFSDM1_DATIN2_PB14_ 1
#define _DFSDM1_DATIN2_PC5_ 1
#define _DFSDM1_DATIN2_PE7_ 1

