susanw1/zscript/receivers/native/arm/implementations/no-os-stm32/src/main/c++/stm32/AlternateFunction/STM32F76x.h
#define DFSDM1_DATIN3_PC7_ PC7,GPIO_AF7
#define DFSDM1_DATIN3_PD9_ PD9,GPIO_AF3
#define DFSDM1_DATIN3_PE4_ PE4,GPIO_AF10
#define _DFSDM1_DATIN3_PC7_ 1
#define _DFSDM1_DATIN3_PD9_ 1
#define _DFSDM1_DATIN3_PE4_ 1

#define DFSDM1_DATIN4_PC0_ PC0,GPIO_AF6
#define DFSDM1_DATIN4_PD7_ PD7,GPIO_AF3
#define DFSDM1_DATIN4_PE10_ PE10,GPIO_AF6
#define _DFSDM1_DATIN4_PC0_ 1
#define _DFSDM1_DATIN4_PD7_ 1
#define _DFSDM1_DATIN4_PE10_ 1

#define DFSDM1_DATIN5_PB6_ PB6,GPIO_AF6
#define DFSDM1_DATIN5_PC11_ PC11,GPIO_AF3
#define DFSDM1_DATIN5_PE12_ PE12,GPIO_AF6
#define _DFSDM1_DATIN5_PB6_ 1
#define _DFSDM1_DATIN5_PC11_ 1
#define _DFSDM1_DATIN5_PE12_ 1

#define DFSDM1_DATIN6_PD1_ PD1,GPIO_AF3
#define DFSDM1_DATIN6_PF13_ PF13,GPIO_AF6
#define _DFSDM1_DATIN6_PD1_ 1
#define _DFSDM1_DATIN6_PF13_ 1

#define DFSDM1_DATIN7_PB10_ PB10,GPIO_AF6
#define DFSDM1_DATIN7_PB9_ PB9,GPIO_AF6
#define DFSDM1_DATIN7_PD0_ PD0,GPIO_AF6
#define _DFSDM1_DATIN7_PB10_ 1
#define _DFSDM1_DATIN7_PB9_ 1
#define _DFSDM1_DATIN7_PD0_ 1

#define DSIHOST_TE_PB11_ PB11,GPIO_AF13
#define DSIHOST_TE_PJ2_ PJ2,GPIO_AF13
#define _DSIHOST_TE_PB11_ 1
#define _DSIHOST_TE_PJ2_ 1

#define ETH_COL_PA3_ PA3,GPIO_AF11
#define ETH_COL_PH3_ PH3,GPIO_AF11
#define _ETH_COL_PA3_ 1
#define _ETH_COL_PH3_ 1

#define ETH_CRS_PA0/WKUP_ PA0/WKUP,GPIO_AF11
#define ETH_CRS_PH2_ PH2,GPIO_AF11
#define _ETH_CRS_PA0/WKUP_ 1
#define _ETH_CRS_PH2_ 1

#define ETH_CRS_DV_PA7_ PA7,GPIO_AF11
#define _ETH_CRS_DV_PA7_ 1

#define ETH_MDC_PC1_ PC1,GPIO_AF11
#define _ETH_MDC_PC1_ 1

#define ETH_MDIO_PA2_ PA2,GPIO_AF11
#define _ETH_MDIO_PA2_ 1

#define ETH_PPS_OUT_PB5_ PB5,GPIO_AF11
#define ETH_PPS_OUT_PG8_ PG8,GPIO_AF11
#define _ETH_PPS_OUT_PB5_ 1
#define _ETH_PPS_OUT_PG8_ 1

#define ETH_REF_CLK_PA1_ PA1,GPIO_AF11
#define _ETH_REF_CLK_PA1_ 1

#define ETH_RXD0_PC4_ PC4,GPIO_AF11
#define _ETH_RXD0_PC4_ 1

#define ETH_RXD1_PC5_ PC5,GPIO_AF11
#define _ETH_RXD1_PC5_ 1

#define ETH_RXD2_PB0_ PB0,GPIO_AF11
#define ETH_RXD2_PH6_ PH6,GPIO_AF11
#define _ETH_RXD2_PB0_ 1
#define _ETH_RXD2_PH6_ 1

#define ETH_RXD3_PB1_ PB1,GPIO_AF11
#define ETH_RXD3_PH7_ PH7,GPIO_AF11
#define _ETH_RXD3_PB1_ 1
#define _ETH_RXD3_PH7_ 1

#define ETH_RX_CLK_PA1_ PA1,GPIO_AF11
#define _ETH_RX_CLK_PA1_ 1

#define ETH_RX_DV_PA7_ PA7,GPIO_AF11
#define _ETH_RX_DV_PA7_ 1

#define ETH_RX_ER_PB10_ PB10,GPIO_AF11
#define ETH_RX_ER_PI10_ PI10,GPIO_AF11
#define _ETH_RX_ER_PB10_ 1
#define _ETH_RX_ER_PI10_ 1

#define ETH_TXD0_PB12_ PB12,GPIO_AF11
#define ETH_TXD0_PG13_ PG13,GPIO_AF11
#define _ETH_TXD0_PB12_ 1
#define _ETH_TXD0_PG13_ 1

#define ETH_TXD1_PB13_ PB13,GPIO_AF11
#define ETH_TXD1_PG14_ PG14,GPIO_AF11
#define _ETH_TXD1_PB13_ 1
#define _ETH_TXD1_PG14_ 1

#define ETH_TXD2_PC2_ PC2,GPIO_AF11
#define _ETH_TXD2_PC2_ 1

#define ETH_TXD3_PB8_ PB8,GPIO_AF11
#define ETH_TXD3_PE2_ PE2,GPIO_AF11
#define _ETH_TXD3_PB8_ 1
#define _ETH_TXD3_PE2_ 1

#define ETH_TX_CLK_PC3_ PC3,GPIO_AF11
#define _ETH_TX_CLK_PC3_ 1

#define ETH_TX_EN_PB11_ PB11,GPIO_AF11
#define ETH_TX_EN_PG11_ PG11,GPIO_AF11
#define _ETH_TX_EN_PB11_ 1
#define _ETH_TX_EN_PG11_ 1

#define FMC_A0_PF0_ PF0,GPIO_AF12
#define _FMC_A0_PF0_ 1

#define FMC_A1_PF1_ PF1,GPIO_AF12
#define _FMC_A1_PF1_ 1

#define FMC_A10_PG0_ PG0,GPIO_AF12
#define _FMC_A10_PG0_ 1

#define FMC_A11_PG1_ PG1,GPIO_AF12
#define _FMC_A11_PG1_ 1

#define FMC_A12_PG2_ PG2,GPIO_AF12
#define _FMC_A12_PG2_ 1

#define FMC_A13_PG3_ PG3,GPIO_AF12
#define _FMC_A13_PG3_ 1

#define FMC_A14_PG4_ PG4,GPIO_AF12
#define _FMC_A14_PG4_ 1

#define FMC_A15_PG5_ PG5,GPIO_AF12
#define _FMC_A15_PG5_ 1

#define FMC_A16_PD11_ PD11,GPIO_AF12
#define _FMC_A16_PD11_ 1

#define FMC_A17_PD12_ PD12,GPIO_AF12
#define _FMC_A17_PD12_ 1

#define FMC_A18_PD13_ PD13,GPIO_AF12
#define _FMC_A18_PD13_ 1

#define FMC_A19_PE3_ PE3,GPIO_AF12
#define _FMC_A19_PE3_ 1

#define FMC_A2_PF2_ PF2,GPIO_AF12
#define _FMC_A2_PF2_ 1

#define FMC_A20_PE4_ PE4,GPIO_AF12
#define _FMC_A20_PE4_ 1

#define FMC_A21_PE5_ PE5,GPIO_AF12
#define _FMC_A21_PE5_ 1

#define FMC_A22_PE6_ PE6,GPIO_AF12
#define _FMC_A22_PE6_ 1

#define FMC_A23_PE2_ PE2,GPIO_AF12
#define _FMC_A23_PE2_ 1

#define FMC_A24_PG13_ PG13,GPIO_AF12
#define _FMC_A24_PG13_ 1

#define FMC_A25_PG14_ PG14,GPIO_AF12
#define _FMC_A25_PG14_ 1

#define FMC_A3_PF3_ PF3,GPIO_AF12
#define _FMC_A3_PF3_ 1

#define FMC_A4_PF4_ PF4,GPIO_AF12
#define _FMC_A4_PF4_ 1

#define FMC_A5_PF5_ PF5,GPIO_AF12
#define _FMC_A5_PF5_ 1

#define FMC_A6_PF12_ PF12,GPIO_AF12
#define _FMC_A6_PF12_ 1

#define FMC_A7_PF13_ PF13,GPIO_AF12
#define _FMC_A7_PF13_ 1

#define FMC_A8_PF14_ PF14,GPIO_AF12
#define _FMC_A8_PF14_ 1

#define FMC_A9_PF15_ PF15,GPIO_AF12
#define _FMC_A9_PF15_ 1

#define FMC_ALE_PD12_ PD12,GPIO_AF12
#define _FMC_ALE_PD12_ 1

#define FMC_BA0_PG4_ PG4,GPIO_AF12
#define _FMC_BA0_PG4_ 1

#define FMC_BA1_PG5_ PG5,GPIO_AF12
#define _FMC_BA1_PG5_ 1

#define FMC_CLE_PD11_ PD11,GPIO_AF12
#define _FMC_CLE_PD11_ 1

#define FMC_CLK_PD3_ PD3,GPIO_AF12
#define _FMC_CLK_PD3_ 1

#define FMC_D0_PD14_ PD14,GPIO_AF12
#define _FMC_D0_PD14_ 1

#define FMC_D1_PD15_ PD15,GPIO_AF12
#define _FMC_D1_PD15_ 1

#define FMC_D10_PE13_ PE13,GPIO_AF12
#define _FMC_D10_PE13_ 1

#define FMC_D11_PE14_ PE14,GPIO_AF12
#define _FMC_D11_PE14_ 1

#define FMC_D12_PE15_ PE15,GPIO_AF12
#define _FMC_D12_PE15_ 1

#define FMC_D13_PD8_ PD8,GPIO_AF12
#define _FMC_D13_PD8_ 1

#define FMC_D14_PD9_ PD9,GPIO_AF12
#define _FMC_D14_PD9_ 1

#define FMC_D15_PD10_ PD10,GPIO_AF12
#define _FMC_D15_PD10_ 1

#define FMC_D16_PH8_ PH8,GPIO_AF12
#define _FMC_D16_PH8_ 1

#define FMC_D17_PH9_ PH9,GPIO_AF12
#define _FMC_D17_PH9_ 1

#define FMC_D18_PH10_ PH10,GPIO_AF12
#define _FMC_D18_PH10_ 1

#define FMC_D19_PH11_ PH11,GPIO_AF12
#define _FMC_D19_PH11_ 1

#define FMC_D2_PD0_ PD0,GPIO_AF12
#define _FMC_D2_PD0_ 1

#define FMC_D20_PH12_ PH12,GPIO_AF12
#define _FMC_D20_PH12_ 1

#define FMC_D21_PH13_ PH13,GPIO_AF12
#define _FMC_D21_PH13_ 1

#define FMC_D22_PH14_ PH14,GPIO_AF12
#define _FMC_D22_PH14_ 1

#define FMC_D23_PH15_ PH15,GPIO_AF12
#define _FMC_D23_PH15_ 1

#define FMC_D24_PI0_ PI0,GPIO_AF12
#define _FMC_D24_PI0_ 1

#define FMC_D25_PI1_ PI1,GPIO_AF12
#define _FMC_D25_PI1_ 1

#define FMC_D26_PI2_ PI2,GPIO_AF12
#define _FMC_D26_PI2_ 1

