susanw1/zscript/receivers/native/arm/implementations/no-os-stm32/src/main/c++/stm32/AlternateFunction/STM32F76x.h
#define FMC_D27_PI3_ PI3,GPIO_AF12
#define _FMC_D27_PI3_ 1

#define FMC_D28_PI6_ PI6,GPIO_AF12
#define _FMC_D28_PI6_ 1

#define FMC_D29_PI7_ PI7,GPIO_AF12
#define _FMC_D29_PI7_ 1

#define FMC_D3_PD1_ PD1,GPIO_AF12
#define _FMC_D3_PD1_ 1

#define FMC_D30_PI9_ PI9,GPIO_AF12
#define _FMC_D30_PI9_ 1

#define FMC_D31_PI10_ PI10,GPIO_AF12
#define _FMC_D31_PI10_ 1

#define FMC_D4_PE7_ PE7,GPIO_AF12
#define _FMC_D4_PE7_ 1

#define FMC_D5_PE8_ PE8,GPIO_AF12
#define _FMC_D5_PE8_ 1

#define FMC_D6_PE9_ PE9,GPIO_AF12
#define _FMC_D6_PE9_ 1

#define FMC_D7_PE10_ PE10,GPIO_AF12
#define _FMC_D7_PE10_ 1

#define FMC_D8_PE11_ PE11,GPIO_AF12
#define _FMC_D8_PE11_ 1

#define FMC_D9_PE12_ PE12,GPIO_AF12
#define _FMC_D9_PE12_ 1

#define FMC_DA0_PD14_ PD14,GPIO_AF12
#define _FMC_DA0_PD14_ 1

#define FMC_DA1_PD15_ PD15,GPIO_AF12
#define _FMC_DA1_PD15_ 1

#define FMC_DA10_PE13_ PE13,GPIO_AF12
#define _FMC_DA10_PE13_ 1

#define FMC_DA11_PE14_ PE14,GPIO_AF12
#define _FMC_DA11_PE14_ 1

#define FMC_DA12_PE15_ PE15,GPIO_AF12
#define _FMC_DA12_PE15_ 1

#define FMC_DA13_PD8_ PD8,GPIO_AF12
#define _FMC_DA13_PD8_ 1

#define FMC_DA14_PD9_ PD9,GPIO_AF12
#define _FMC_DA14_PD9_ 1

#define FMC_DA15_PD10_ PD10,GPIO_AF12
#define _FMC_DA15_PD10_ 1

#define FMC_DA2_PD0_ PD0,GPIO_AF12
#define _FMC_DA2_PD0_ 1

#define FMC_DA3_PD1_ PD1,GPIO_AF12
#define _FMC_DA3_PD1_ 1

#define FMC_DA4_PE7_ PE7,GPIO_AF12
#define _FMC_DA4_PE7_ 1

#define FMC_DA5_PE8_ PE8,GPIO_AF12
#define _FMC_DA5_PE8_ 1

#define FMC_DA6_PE9_ PE9,GPIO_AF12
#define _FMC_DA6_PE9_ 1

#define FMC_DA7_PE10_ PE10,GPIO_AF12
#define _FMC_DA7_PE10_ 1

#define FMC_DA8_PE11_ PE11,GPIO_AF12
#define _FMC_DA8_PE11_ 1

#define FMC_DA9_PE12_ PE12,GPIO_AF12
#define _FMC_DA9_PE12_ 1

#define FMC_INT_PG7_ PG7,GPIO_AF12
#define _FMC_INT_PG7_ 1

#define FMC_NBL0_PE0_ PE0,GPIO_AF12
#define _FMC_NBL0_PE0_ 1

#define FMC_NBL1_PE1_ PE1,GPIO_AF12
#define _FMC_NBL1_PE1_ 1

#define FMC_NBL2_PI4_ PI4,GPIO_AF12
#define _FMC_NBL2_PI4_ 1

#define FMC_NBL3_PI5_ PI5,GPIO_AF12
#define _FMC_NBL3_PI5_ 1

#define FMC_NCE_PC8_ PC8,GPIO_AF9
#define FMC_NCE_PG9_ PG9,GPIO_AF12
#define _FMC_NCE_PC8_ 1
#define _FMC_NCE_PG9_ 1

#define FMC_NE1_PC7_ PC7,GPIO_AF9
#define FMC_NE1_PD7_ PD7,GPIO_AF12
#define _FMC_NE1_PC7_ 1
#define _FMC_NE1_PD7_ 1

#define FMC_NE2_PC8_ PC8,GPIO_AF9
#define FMC_NE2_PG9_ PG9,GPIO_AF12
#define _FMC_NE2_PC8_ 1
#define _FMC_NE2_PG9_ 1

#define FMC_NE3_PG10_ PG10,GPIO_AF12
#define FMC_NE3_PG6_ PG6,GPIO_AF12
#define _FMC_NE3_PG10_ 1
#define _FMC_NE3_PG6_ 1

#define FMC_NE4_PG12_ PG12,GPIO_AF12
#define _FMC_NE4_PG12_ 1

#define FMC_NL_PB7_ PB7,GPIO_AF12
#define _FMC_NL_PB7_ 1

#define FMC_NOE_PD4_ PD4,GPIO_AF12
#define _FMC_NOE_PD4_ 1

#define FMC_NWAIT_PC6_ PC6,GPIO_AF9
#define FMC_NWAIT_PD6_ PD6,GPIO_AF12
#define _FMC_NWAIT_PC6_ 1
#define _FMC_NWAIT_PD6_ 1

#define FMC_NWE_PD5_ PD5,GPIO_AF12
#define _FMC_NWE_PD5_ 1

#define FMC_SDCKE0_PC3_ PC3,GPIO_AF12
#define FMC_SDCKE0_PC5_ PC5,GPIO_AF12
#define FMC_SDCKE0_PH2_ PH2,GPIO_AF12
#define _FMC_SDCKE0_PC3_ 1
#define _FMC_SDCKE0_PC5_ 1
#define _FMC_SDCKE0_PH2_ 1

#define FMC_SDCKE1_PB5_ PB5,GPIO_AF12
#define FMC_SDCKE1_PH7_ PH7,GPIO_AF12
#define _FMC_SDCKE1_PB5_ 1
#define _FMC_SDCKE1_PH7_ 1

#define FMC_SDCLK_PG8_ PG8,GPIO_AF12
#define _FMC_SDCLK_PG8_ 1

#define FMC_SDNCAS_PG15_ PG15,GPIO_AF12
#define _FMC_SDNCAS_PG15_ 1

#define FMC_SDNE0_PC2_ PC2,GPIO_AF12
#define FMC_SDNE0_PC4_ PC4,GPIO_AF12
#define FMC_SDNE0_PH3_ PH3,GPIO_AF12
#define _FMC_SDNE0_PC2_ 1
#define _FMC_SDNE0_PC4_ 1
#define _FMC_SDNE0_PH3_ 1

#define FMC_SDNE1_PB6_ PB6,GPIO_AF12
#define FMC_SDNE1_PH6_ PH6,GPIO_AF12
#define _FMC_SDNE1_PB6_ 1
#define _FMC_SDNE1_PH6_ 1

#define FMC_SDNRAS_PF11_ PF11,GPIO_AF12
#define _FMC_SDNRAS_PF11_ 1

#define FMC_SDNWE_PA7_ PA7,GPIO_AF12
#define FMC_SDNWE_PC0_ PC0,GPIO_AF12
#define FMC_SDNWE_PH5_ PH5,GPIO_AF12
#define _FMC_SDNWE_PA7_ 1
#define _FMC_SDNWE_PC0_ 1
#define _FMC_SDNWE_PH5_ 1

#define I2C1_SCL_PB6_ PB6,GPIO_AF4
#define I2C1_SCL_PB8_ PB8,GPIO_AF4
#define _I2C1_SCL_PB6_ 1
#define _I2C1_SCL_PB8_ 1

#define I2C1_SDA_PB7_ PB7,GPIO_AF4
#define I2C1_SDA_PB9_ PB9,GPIO_AF4
#define _I2C1_SDA_PB7_ 1
#define _I2C1_SDA_PB9_ 1

#define I2C1_SMBA_PB5_ PB5,GPIO_AF4
#define _I2C1_SMBA_PB5_ 1

#define I2C2_SCL_PB10_ PB10,GPIO_AF4
#define I2C2_SCL_PF1_ PF1,GPIO_AF4
#define I2C2_SCL_PH4_ PH4,GPIO_AF4
#define _I2C2_SCL_PB10_ 1
#define _I2C2_SCL_PF1_ 1
#define _I2C2_SCL_PH4_ 1

#define I2C2_SDA_PB11_ PB11,GPIO_AF4
#define I2C2_SDA_PF0_ PF0,GPIO_AF4
#define I2C2_SDA_PH5_ PH5,GPIO_AF4
#define _I2C2_SDA_PB11_ 1
#define _I2C2_SDA_PF0_ 1
#define _I2C2_SDA_PH5_ 1

#define I2C2_SMBA_PB12_ PB12,GPIO_AF4
#define I2C2_SMBA_PF2_ PF2,GPIO_AF4
#define I2C2_SMBA_PH6_ PH6,GPIO_AF4
#define _I2C2_SMBA_PB12_ 1
#define _I2C2_SMBA_PF2_ 1
#define _I2C2_SMBA_PH6_ 1

#define I2C3_SCL_PA8_ PA8,GPIO_AF4
#define I2C3_SCL_PH7_ PH7,GPIO_AF4
#define _I2C3_SCL_PA8_ 1
#define _I2C3_SCL_PH7_ 1

#define I2C3_SDA_PC9_ PC9,GPIO_AF4
#define I2C3_SDA_PH8_ PH8,GPIO_AF4
#define _I2C3_SDA_PC9_ 1
#define _I2C3_SDA_PH8_ 1

#define I2C3_SMBA_PA9_ PA9,GPIO_AF4
#define I2C3_SMBA_PH9_ PH9,GPIO_AF4
#define _I2C3_SMBA_PA9_ 1
#define _I2C3_SMBA_PH9_ 1

#define I2C4_SCL_PB6_ PB6,GPIO_AF11
#define I2C4_SCL_PB8_ PB8,GPIO_AF1
#define I2C4_SCL_PD12_ PD12,GPIO_AF4
#define I2C4_SCL_PF14_ PF14,GPIO_AF4
#define I2C4_SCL_PH11_ PH11,GPIO_AF4
#define _I2C4_SCL_PB6_ 1
#define _I2C4_SCL_PB8_ 1
#define _I2C4_SCL_PD12_ 1
#define _I2C4_SCL_PF14_ 1
#define _I2C4_SCL_PH11_ 1

#define I2C4_SDA_PB7_ PB7,GPIO_AF11
#define I2C4_SDA_PB9_ PB9,GPIO_AF1
#define I2C4_SDA_PD13_ PD13,GPIO_AF4
#define I2C4_SDA_PF15_ PF15,GPIO_AF4
#define I2C4_SDA_PH12_ PH12,GPIO_AF4
#define _I2C4_SDA_PB7_ 1
#define _I2C4_SDA_PB9_ 1
#define _I2C4_SDA_PD13_ 1
#define _I2C4_SDA_PF15_ 1
#define _I2C4_SDA_PH12_ 1

#define I2C4_SMBA_PB9_ PB9,GPIO_AF11
#define I2C4_SMBA_PD11_ PD11,GPIO_AF4
#define I2C4_SMBA_PF13_ PF13,GPIO_AF4
#define I2C4_SMBA_PH10_ PH10,GPIO_AF4
#define _I2C4_SMBA_PB9_ 1
#define _I2C4_SMBA_PD11_ 1
#define _I2C4_SMBA_PF13_ 1
#define _I2C4_SMBA_PH10_ 1

#define I2S1_CK_PA5_ PA5,GPIO_AF5
#define I2S1_CK_PB3_ PB3,GPIO_AF5
#define I2S1_CK_PG11_ PG11,GPIO_AF5
#define _I2S1_CK_PA5_ 1
#define _I2S1_CK_PB3_ 1
#define _I2S1_CK_PG11_ 1

#define I2S1_MCK_PC4_ PC4,GPIO_AF5
#define _I2S1_MCK_PC4_ 1

#define I2S1_SD_PA7_ PA7,GPIO_AF5
#define I2S1_SD_PB5_ PB5,GPIO_AF5
#define I2S1_SD_PD7_ PD7,GPIO_AF5
#define _I2S1_SD_PA7_ 1
#define _I2S1_SD_PB5_ 1
#define _I2S1_SD_PD7_ 1

#define I2S1_WS_PA15_ PA15,GPIO_AF5
#define I2S1_WS_PA4_ PA4,GPIO_AF5
#define I2S1_WS_PG10_ PG10,GPIO_AF5
#define _I2S1_WS_PA15_ 1
#define _I2S1_WS_PA4_ 1
#define _I2S1_WS_PG10_ 1

#define I2S2_CK_PA12_ PA12,GPIO_AF5
#define I2S2_CK_PA9_ PA9,GPIO_AF5
#define I2S2_CK_PB10_ PB10,GPIO_AF5
#define I2S2_CK_PB13_ PB13,GPIO_AF5
#define I2S2_CK_PD3_ PD3,GPIO_AF5
#define I2S2_CK_PI1_ PI1,GPIO_AF5
#define _I2S2_CK_PA12_ 1
#define _I2S2_CK_PA9_ 1
#define _I2S2_CK_PB10_ 1
#define _I2S2_CK_PB13_ 1
#define _I2S2_CK_PD3_ 1
#define _I2S2_CK_PI1_ 1

#define I2S2_MCK_PC6_ PC6,GPIO_AF5
#define _I2S2_MCK_PC6_ 1

