susanw1/zscript/receivers/native/arm/implementations/no-os-stm32/src/main/c++/stm32/AlternateFunction/STM32F76x.h
#define LTDC_R3_PB0_ PB0,GPIO_AF9
#define LTDC_R3_PH9_ PH9,GPIO_AF14
#define LTDC_R3_PJ2_ PJ2,GPIO_AF14
#define _LTDC_R3_PB0_ 1
#define _LTDC_R3_PH9_ 1
#define _LTDC_R3_PJ2_ 1

#define LTDC_R4_PA11_ PA11,GPIO_AF14
#define LTDC_R4_PA5_ PA5,GPIO_AF14
#define LTDC_R4_PH10_ PH10,GPIO_AF14
#define LTDC_R4_PJ3_ PJ3,GPIO_AF14
#define _LTDC_R4_PA11_ 1
#define _LTDC_R4_PA5_ 1
#define _LTDC_R4_PH10_ 1
#define _LTDC_R4_PJ3_ 1

#define LTDC_R5_PA12_ PA12,GPIO_AF14
#define LTDC_R5_PA9_ PA9,GPIO_AF14
#define LTDC_R5_PC0_ PC0,GPIO_AF14
#define LTDC_R5_PH11_ PH11,GPIO_AF14
#define LTDC_R5_PJ4_ PJ4,GPIO_AF14
#define _LTDC_R5_PA12_ 1
#define _LTDC_R5_PA9_ 1
#define _LTDC_R5_PC0_ 1
#define _LTDC_R5_PH11_ 1
#define _LTDC_R5_PJ4_ 1

#define LTDC_R6_PA8_ PA8,GPIO_AF14
#define LTDC_R6_PB1_ PB1,GPIO_AF9
#define LTDC_R6_PH12_ PH12,GPIO_AF14
#define LTDC_R6_PJ5_ PJ5,GPIO_AF14
#define _LTDC_R6_PA8_ 1
#define _LTDC_R6_PB1_ 1
#define _LTDC_R6_PH12_ 1
#define _LTDC_R6_PJ5_ 1

#define LTDC_R7_PE15_ PE15,GPIO_AF14
#define LTDC_R7_PG6_ PG6,GPIO_AF14
#define LTDC_R7_PJ0_ PJ0,GPIO_AF9
#define LTDC_R7_PJ6_ PJ6,GPIO_AF14
#define _LTDC_R7_PE15_ 1
#define _LTDC_R7_PG6_ 1
#define _LTDC_R7_PJ0_ 1
#define _LTDC_R7_PJ6_ 1

#define LTDC_VSYNC_PA4_ PA4,GPIO_AF14
#define LTDC_VSYNC_PI13_ PI13,GPIO_AF14
#define LTDC_VSYNC_PI9_ PI9,GPIO_AF14
#define _LTDC_VSYNC_PA4_ 1
#define _LTDC_VSYNC_PI13_ 1
#define _LTDC_VSYNC_PI9_ 1

#define MDIOS_MDC_PA6_ PA6,GPIO_AF12
#define MDIOS_MDC_PC1_ PC1,GPIO_AF12
#define _MDIOS_MDC_PA6_ 1
#define _MDIOS_MDC_PC1_ 1

#define MDIOS_MDIO_PA10_ PA10,GPIO_AF12
#define MDIOS_MDIO_PA2_ PA2,GPIO_AF12
#define _MDIOS_MDIO_PA10_ 1
#define _MDIOS_MDIO_PA2_ 1

#define QUADSPI_BK1_IO0_PC9_ PC9,GPIO_AF9
#define QUADSPI_BK1_IO0_PD11_ PD11,GPIO_AF9
#define QUADSPI_BK1_IO0_PF8_ PF8,GPIO_AF10
#define _QUADSPI_BK1_IO0_PC9_ 1
#define _QUADSPI_BK1_IO0_PD11_ 1
#define _QUADSPI_BK1_IO0_PF8_ 1

#define QUADSPI_BK1_IO1_PC10_ PC10,GPIO_AF9
#define QUADSPI_BK1_IO1_PD12_ PD12,GPIO_AF9
#define QUADSPI_BK1_IO1_PF9_ PF9,GPIO_AF10
#define _QUADSPI_BK1_IO1_PC10_ 1
#define _QUADSPI_BK1_IO1_PD12_ 1
#define _QUADSPI_BK1_IO1_PF9_ 1

#define QUADSPI_BK1_IO2_PE2_ PE2,GPIO_AF9
#define QUADSPI_BK1_IO2_PF7_ PF7,GPIO_AF9
#define _QUADSPI_BK1_IO2_PE2_ 1
#define _QUADSPI_BK1_IO2_PF7_ 1

#define QUADSPI_BK1_IO3_PA1_ PA1,GPIO_AF9
#define QUADSPI_BK1_IO3_PD13_ PD13,GPIO_AF9
#define QUADSPI_BK1_IO3_PF6_ PF6,GPIO_AF9
#define _QUADSPI_BK1_IO3_PA1_ 1
#define _QUADSPI_BK1_IO3_PD13_ 1
#define _QUADSPI_BK1_IO3_PF6_ 1

#define QUADSPI_BK1_NCS_PB10_ PB10,GPIO_AF9
#define QUADSPI_BK1_NCS_PB6_ PB6,GPIO_AF10
#define _QUADSPI_BK1_NCS_PB10_ 1
#define _QUADSPI_BK1_NCS_PB6_ 1

#define QUADSPI_BK2_IO0_PE7_ PE7,GPIO_AF10
#define QUADSPI_BK2_IO0_PH2_ PH2,GPIO_AF9
#define _QUADSPI_BK2_IO0_PE7_ 1
#define _QUADSPI_BK2_IO0_PH2_ 1

#define QUADSPI_BK2_IO1_PE8_ PE8,GPIO_AF10
#define QUADSPI_BK2_IO1_PH3_ PH3,GPIO_AF9
#define _QUADSPI_BK2_IO1_PE8_ 1
#define _QUADSPI_BK2_IO1_PH3_ 1

#define QUADSPI_BK2_IO2_PE9_ PE9,GPIO_AF10
#define QUADSPI_BK2_IO2_PG9_ PG9,GPIO_AF9
#define _QUADSPI_BK2_IO2_PE9_ 1
#define _QUADSPI_BK2_IO2_PG9_ 1

#define QUADSPI_BK2_IO3_PE10_ PE10,GPIO_AF10
#define QUADSPI_BK2_IO3_PG14_ PG14,GPIO_AF9
#define _QUADSPI_BK2_IO3_PE10_ 1
#define _QUADSPI_BK2_IO3_PG14_ 1

#define QUADSPI_BK2_NCS_PC11_ PC11,GPIO_AF9
#define _QUADSPI_BK2_NCS_PC11_ 1

#define QUADSPI_CLK_PB2_ PB2,GPIO_AF9
#define QUADSPI_CLK_PF10_ PF10,GPIO_AF9
#define _QUADSPI_CLK_PB2_ 1
#define _QUADSPI_CLK_PF10_ 1

#define RCC_MCO_1_PA8_ PA8,GPIO_AF0
#define _RCC_MCO_1_PA8_ 1

#define RCC_MCO_2_PC9_ PC9,GPIO_AF0
#define _RCC_MCO_2_PC9_ 1

#define RTC_REFIN_PB15_ PB15,GPIO_AF0
#define _RTC_REFIN_PB15_ 1

#define SAI1_FS_A_PE4_ PE4,GPIO_AF6
#define _SAI1_FS_A_PE4_ 1

#define SAI1_FS_B_PF9_ PF9,GPIO_AF6
#define _SAI1_FS_B_PF9_ 1

#define SAI1_MCLK_A_PE2_ PE2,GPIO_AF6
#define SAI1_MCLK_A_PG7_ PG7,GPIO_AF6
#define _SAI1_MCLK_A_PE2_ 1
#define _SAI1_MCLK_A_PG7_ 1

#define SAI1_MCLK_B_PF7_ PF7,GPIO_AF6
#define _SAI1_MCLK_B_PF7_ 1

#define SAI1_SCK_A_PE5_ PE5,GPIO_AF6
#define _SAI1_SCK_A_PE5_ 1

#define SAI1_SCK_B_PF8_ PF8,GPIO_AF6
#define _SAI1_SCK_B_PF8_ 1

#define SAI1_SD_A_PB2_ PB2,GPIO_AF6
#define SAI1_SD_A_PC1_ PC1,GPIO_AF6
#define SAI1_SD_A_PD6_ PD6,GPIO_AF6
#define SAI1_SD_A_PE6_ PE6,GPIO_AF6
#define _SAI1_SD_A_PB2_ 1
#define _SAI1_SD_A_PC1_ 1
#define _SAI1_SD_A_PD6_ 1
#define _SAI1_SD_A_PE6_ 1

#define SAI1_SD_B_PE3_ PE3,GPIO_AF6
#define SAI1_SD_B_PF6_ PF6,GPIO_AF6
#define _SAI1_SD_B_PE3_ 1
#define _SAI1_SD_B_PF6_ 1

#define SAI2_FS_A_PD12_ PD12,GPIO_AF10
#define SAI2_FS_A_PI7_ PI7,GPIO_AF10
#define _SAI2_FS_A_PD12_ 1
#define _SAI2_FS_A_PI7_ 1

#define SAI2_FS_B_PA12_ PA12,GPIO_AF8
#define SAI2_FS_B_PC0_ PC0,GPIO_AF8
#define SAI2_FS_B_PE13_ PE13,GPIO_AF10
#define SAI2_FS_B_PG9_ PG9,GPIO_AF10
#define _SAI2_FS_B_PA12_ 1
#define _SAI2_FS_B_PC0_ 1
#define _SAI2_FS_B_PE13_ 1
#define _SAI2_FS_B_PG9_ 1

#define SAI2_MCLK_A_PE0_ PE0,GPIO_AF10
#define SAI2_MCLK_A_PI4_ PI4,GPIO_AF10
#define _SAI2_MCLK_A_PE0_ 1
#define _SAI2_MCLK_A_PI4_ 1

#define SAI2_MCLK_B_PA1_ PA1,GPIO_AF10
#define SAI2_MCLK_B_PE14_ PE14,GPIO_AF10
#define SAI2_MCLK_B_PE6_ PE6,GPIO_AF10
#define SAI2_MCLK_B_PH3_ PH3,GPIO_AF10
#define _SAI2_MCLK_B_PA1_ 1
#define _SAI2_MCLK_B_PE14_ 1
#define _SAI2_MCLK_B_PE6_ 1
#define _SAI2_MCLK_B_PH3_ 1

#define SAI2_SCK_A_PD13_ PD13,GPIO_AF10
#define SAI2_SCK_A_PI5_ PI5,GPIO_AF10
#define _SAI2_SCK_A_PD13_ 1
#define _SAI2_SCK_A_PI5_ 1

#define SAI2_SCK_B_PA2_ PA2,GPIO_AF8
#define SAI2_SCK_B_PE12_ PE12,GPIO_AF10
#define SAI2_SCK_B_PH2_ PH2,GPIO_AF10
#define _SAI2_SCK_B_PA2_ 1
#define _SAI2_SCK_B_PE12_ 1
#define _SAI2_SCK_B_PH2_ 1

#define SAI2_SD_A_PD11_ PD11,GPIO_AF10
#define SAI2_SD_A_PI6_ PI6,GPIO_AF10
#define _SAI2_SD_A_PD11_ 1
#define _SAI2_SD_A_PI6_ 1

#define SAI2_SD_B_PA0/WKUP_ PA0/WKUP,GPIO_AF10
#define SAI2_SD_B_PE11_ PE11,GPIO_AF10
#define SAI2_SD_B_PF11_ PF11,GPIO_AF10
#define SAI2_SD_B_PG10_ PG10,GPIO_AF10
#define _SAI2_SD_B_PA0/WKUP_ 1
#define _SAI2_SD_B_PE11_ 1
#define _SAI2_SD_B_PF11_ 1
#define _SAI2_SD_B_PG10_ 1

#define SDMMC1_CK_PC12_ PC12,GPIO_AF12
#define _SDMMC1_CK_PC12_ 1

