susanw1/zscript/receivers/native/arm/implementations/no-os-stm32/src/main/c++/stm32/AlternateFunction/STM32F76x.h
#define SDMMC1_CMD_PD2_ PD2,GPIO_AF12
#define _SDMMC1_CMD_PD2_ 1

#define SDMMC1_D0_PC8_ PC8,GPIO_AF12
#define _SDMMC1_D0_PC8_ 1

#define SDMMC1_D1_PC9_ PC9,GPIO_AF12
#define _SDMMC1_D1_PC9_ 1

#define SDMMC1_D2_PC10_ PC10,GPIO_AF12
#define _SDMMC1_D2_PC10_ 1

#define SDMMC1_D3_PC11_ PC11,GPIO_AF12
#define _SDMMC1_D3_PC11_ 1

#define SDMMC1_D4_PB8_ PB8,GPIO_AF12
#define _SDMMC1_D4_PB8_ 1

#define SDMMC1_D5_PB9_ PB9,GPIO_AF12
#define _SDMMC1_D5_PB9_ 1

#define SDMMC1_D6_PC6_ PC6,GPIO_AF12
#define _SDMMC1_D6_PC6_ 1

#define SDMMC1_D7_PC7_ PC7,GPIO_AF12
#define _SDMMC1_D7_PC7_ 1

#define SDMMC2_CK_PD6_ PD6,GPIO_AF11
#define _SDMMC2_CK_PD6_ 1

#define SDMMC2_CMD_PD7_ PD7,GPIO_AF11
#define _SDMMC2_CMD_PD7_ 1

#define SDMMC2_D0_PB14_ PB14,GPIO_AF10
#define SDMMC2_D0_PG9_ PG9,GPIO_AF11
#define _SDMMC2_D0_PB14_ 1
#define _SDMMC2_D0_PG9_ 1

#define SDMMC2_D1_PB15_ PB15,GPIO_AF10
#define SDMMC2_D1_PG10_ PG10,GPIO_AF11
#define _SDMMC2_D1_PB15_ 1
#define _SDMMC2_D1_PG10_ 1

#define SDMMC2_D2_PB3_ PB3,GPIO_AF10
#define SDMMC2_D2_PG11_ PG11,GPIO_AF10
#define _SDMMC2_D2_PB3_ 1
#define _SDMMC2_D2_PG11_ 1

#define SDMMC2_D3_PB4_ PB4,GPIO_AF10
#define SDMMC2_D3_PG12_ PG12,GPIO_AF11
#define _SDMMC2_D3_PB4_ 1
#define _SDMMC2_D3_PG12_ 1

#define SDMMC2_D4_PB8_ PB8,GPIO_AF10
#define _SDMMC2_D4_PB8_ 1

#define SDMMC2_D5_PB9_ PB9,GPIO_AF10
#define _SDMMC2_D5_PB9_ 1

#define SDMMC2_D6_PC6_ PC6,GPIO_AF10
#define _SDMMC2_D6_PC6_ 1

#define SDMMC2_D7_PC7_ PC7,GPIO_AF10
#define _SDMMC2_D7_PC7_ 1

#define SPDIFRX_IN0_PD7_ PD7,GPIO_AF8
#define SPDIFRX_IN0_PG11_ PG11,GPIO_AF7
#define _SPDIFRX_IN0_PD7_ 1
#define _SPDIFRX_IN0_PG11_ 1

#define SPDIFRX_IN1_PD8_ PD8,GPIO_AF8
#define SPDIFRX_IN1_PG12_ PG12,GPIO_AF7
#define _SPDIFRX_IN1_PD8_ 1
#define _SPDIFRX_IN1_PG12_ 1

#define SPDIFRX_IN2_PC4_ PC4,GPIO_AF8
#define SPDIFRX_IN2_PG8_ PG8,GPIO_AF7
#define _SPDIFRX_IN2_PC4_ 1
#define _SPDIFRX_IN2_PG8_ 1

#define SPDIFRX_IN3_PC5_ PC5,GPIO_AF8
#define SPDIFRX_IN3_PG9_ PG9,GPIO_AF7
#define _SPDIFRX_IN3_PC5_ 1
#define _SPDIFRX_IN3_PG9_ 1

#define SPI1_MISO_PA6_ PA6,GPIO_AF5
#define SPI1_MISO_PB4_ PB4,GPIO_AF5
#define SPI1_MISO_PG9_ PG9,GPIO_AF5
#define _SPI1_MISO_PA6_ 1
#define _SPI1_MISO_PB4_ 1
#define _SPI1_MISO_PG9_ 1

#define SPI1_MOSI_PA7_ PA7,GPIO_AF5
#define SPI1_MOSI_PB5_ PB5,GPIO_AF5
#define SPI1_MOSI_PD7_ PD7,GPIO_AF5
#define _SPI1_MOSI_PA7_ 1
#define _SPI1_MOSI_PB5_ 1
#define _SPI1_MOSI_PD7_ 1

#define SPI1_NSS_PA15_ PA15,GPIO_AF5
#define SPI1_NSS_PA4_ PA4,GPIO_AF5
#define SPI1_NSS_PG10_ PG10,GPIO_AF5
#define _SPI1_NSS_PA15_ 1
#define _SPI1_NSS_PA4_ 1
#define _SPI1_NSS_PG10_ 1

#define SPI1_SCK_PA5_ PA5,GPIO_AF5
#define SPI1_SCK_PB3_ PB3,GPIO_AF5
#define SPI1_SCK_PG11_ PG11,GPIO_AF5
#define _SPI1_SCK_PA5_ 1
#define _SPI1_SCK_PB3_ 1
#define _SPI1_SCK_PG11_ 1

#define SPI2_MISO_PB14_ PB14,GPIO_AF5
#define SPI2_MISO_PC2_ PC2,GPIO_AF5
#define SPI2_MISO_PI2_ PI2,GPIO_AF5
#define _SPI2_MISO_PB14_ 1
#define _SPI2_MISO_PC2_ 1
#define _SPI2_MISO_PI2_ 1

#define SPI2_MOSI_PB15_ PB15,GPIO_AF5
#define SPI2_MOSI_PC1_ PC1,GPIO_AF5
#define SPI2_MOSI_PC3_ PC3,GPIO_AF5
#define SPI2_MOSI_PI3_ PI3,GPIO_AF5
#define _SPI2_MOSI_PB15_ 1
#define _SPI2_MOSI_PC1_ 1
#define _SPI2_MOSI_PC3_ 1
#define _SPI2_MOSI_PI3_ 1

#define SPI2_NSS_PA11_ PA11,GPIO_AF5
#define SPI2_NSS_PB12_ PB12,GPIO_AF5
#define SPI2_NSS_PB4_ PB4,GPIO_AF7
#define SPI2_NSS_PB9_ PB9,GPIO_AF5
#define SPI2_NSS_PI0_ PI0,GPIO_AF5
#define _SPI2_NSS_PA11_ 1
#define _SPI2_NSS_PB12_ 1
#define _SPI2_NSS_PB4_ 1
#define _SPI2_NSS_PB9_ 1
#define _SPI2_NSS_PI0_ 1

#define SPI2_SCK_PA12_ PA12,GPIO_AF5
#define SPI2_SCK_PA9_ PA9,GPIO_AF5
#define SPI2_SCK_PB10_ PB10,GPIO_AF5
#define SPI2_SCK_PB13_ PB13,GPIO_AF5
#define SPI2_SCK_PD3_ PD3,GPIO_AF5
#define SPI2_SCK_PI1_ PI1,GPIO_AF5
#define _SPI2_SCK_PA12_ 1
#define _SPI2_SCK_PA9_ 1
#define _SPI2_SCK_PB10_ 1
#define _SPI2_SCK_PB13_ 1
#define _SPI2_SCK_PD3_ 1
#define _SPI2_SCK_PI1_ 1

#define SPI3_MISO_PB4_ PB4,GPIO_AF6
#define SPI3_MISO_PC11_ PC11,GPIO_AF6
#define _SPI3_MISO_PB4_ 1
#define _SPI3_MISO_PC11_ 1

#define SPI3_MOSI_PB2_ PB2,GPIO_AF7
#define SPI3_MOSI_PB5_ PB5,GPIO_AF6
#define SPI3_MOSI_PC12_ PC12,GPIO_AF6
#define SPI3_MOSI_PD6_ PD6,GPIO_AF5
#define _SPI3_MOSI_PB2_ 1
#define _SPI3_MOSI_PB5_ 1
#define _SPI3_MOSI_PC12_ 1
#define _SPI3_MOSI_PD6_ 1

#define SPI3_NSS_PA15_ PA15,GPIO_AF6
#define SPI3_NSS_PA4_ PA4,GPIO_AF6
#define _SPI3_NSS_PA15_ 1
#define _SPI3_NSS_PA4_ 1

#define SPI3_SCK_PB3_ PB3,GPIO_AF6
#define SPI3_SCK_PC10_ PC10,GPIO_AF6
#define _SPI3_SCK_PB3_ 1
#define _SPI3_SCK_PC10_ 1

#define SPI4_MISO_PE13_ PE13,GPIO_AF5
#define SPI4_MISO_PE5_ PE5,GPIO_AF5
#define _SPI4_MISO_PE13_ 1
#define _SPI4_MISO_PE5_ 1

#define SPI4_MOSI_PE14_ PE14,GPIO_AF5
#define SPI4_MOSI_PE6_ PE6,GPIO_AF5
#define _SPI4_MOSI_PE14_ 1
#define _SPI4_MOSI_PE6_ 1

#define SPI4_NSS_PE11_ PE11,GPIO_AF5
#define SPI4_NSS_PE4_ PE4,GPIO_AF5
#define _SPI4_NSS_PE11_ 1
#define _SPI4_NSS_PE4_ 1

#define SPI4_SCK_PE12_ PE12,GPIO_AF5
#define SPI4_SCK_PE2_ PE2,GPIO_AF5
#define _SPI4_SCK_PE12_ 1
#define _SPI4_SCK_PE2_ 1

#define SPI5_MISO_PF8_ PF8,GPIO_AF5
#define SPI5_MISO_PH7_ PH7,GPIO_AF5
#define _SPI5_MISO_PF8_ 1
#define _SPI5_MISO_PH7_ 1

#define SPI5_MOSI_PF11_ PF11,GPIO_AF5
#define SPI5_MOSI_PF9_ PF9,GPIO_AF5
#define _SPI5_MOSI_PF11_ 1
#define _SPI5_MOSI_PF9_ 1

#define SPI5_NSS_PF6_ PF6,GPIO_AF5
#define SPI5_NSS_PH5_ PH5,GPIO_AF5
#define _SPI5_NSS_PF6_ 1
#define _SPI5_NSS_PH5_ 1

#define SPI5_SCK_PF7_ PF7,GPIO_AF5
#define SPI5_SCK_PH6_ PH6,GPIO_AF5
#define _SPI5_SCK_PF7_ 1
#define _SPI5_SCK_PH6_ 1

#define SPI6_MISO_PA6_ PA6,GPIO_AF8
#define SPI6_MISO_PB4_ PB4,GPIO_AF8
#define SPI6_MISO_PG12_ PG12,GPIO_AF5
#define _SPI6_MISO_PA6_ 1
#define _SPI6_MISO_PB4_ 1
#define _SPI6_MISO_PG12_ 1

#define SPI6_MOSI_PA7_ PA7,GPIO_AF8
#define SPI6_MOSI_PB5_ PB5,GPIO_AF8
#define SPI6_MOSI_PG14_ PG14,GPIO_AF5
#define _SPI6_MOSI_PA7_ 1
#define _SPI6_MOSI_PB5_ 1
#define _SPI6_MOSI_PG14_ 1

#define SPI6_NSS_PA15_ PA15,GPIO_AF7
#define SPI6_NSS_PA4_ PA4,GPIO_AF8
#define SPI6_NSS_PG8_ PG8,GPIO_AF5
#define _SPI6_NSS_PA15_ 1
#define _SPI6_NSS_PA4_ 1
#define _SPI6_NSS_PG8_ 1

#define SPI6_SCK_PA5_ PA5,GPIO_AF8
#define SPI6_SCK_PB3_ PB3,GPIO_AF8
#define SPI6_SCK_PG13_ PG13,GPIO_AF5
#define _SPI6_SCK_PA5_ 1
#define _SPI6_SCK_PB3_ 1
#define _SPI6_SCK_PG13_ 1

#define SYS_JTCK_SWCLK_PA14_ PA14,GPIO_AF0
#define _SYS_JTCK_SWCLK_PA14_ 1

#define SYS_JTDI_PA15_ PA15,GPIO_AF0
#define _SYS_JTDI_PA15_ 1

#define SYS_JTDO_SWO_PB3_ PB3,GPIO_AF0
#define _SYS_JTDO_SWO_PB3_ 1

#define SYS_JTMS_SWDIO_PA13_ PA13,GPIO_AF0
#define _SYS_JTMS_SWDIO_PA13_ 1

#define SYS_JTRST_PB4_ PB4,GPIO_AF0
#define _SYS_JTRST_PB4_ 1

#define SYS_TRACECLK_PE2_ PE2,GPIO_AF0
#define _SYS_TRACECLK_PE2_ 1

#define SYS_TRACED0_PC1_ PC1,GPIO_AF0
#define SYS_TRACED0_PE3_ PE3,GPIO_AF0
#define SYS_TRACED0_PG13_ PG13,GPIO_AF0
#define _SYS_TRACED0_PC1_ 1
#define _SYS_TRACED0_PE3_ 1
#define _SYS_TRACED0_PG13_ 1

